_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_РаспределениеМатериаловПоСтроительнымРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_РаспределениеМатериаловПоСтроительнымРаботам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтгрузитьОбособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗаказов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Требуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/ЗаказМатериаловВПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗаказМатериаловВПроизводство</Name>
			<BasedOn>
				<xr:Item>Document.ИзменениеАссортимента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыМатериаловВПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ГрафикОтгрузкиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ФактическиеДанныеБюджетирования</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыМатериаловСУчетомКорректировок</xr:Item>
				<xr:Item>AccumulationRegister.СвободныеОстатки</xr:Item>
				<xr:Item>AccumulationRegister.ГрафикПоступленияТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПоступлению</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеховаяКладовая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтгружатьЧастями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаполненияМногооборотнойТары</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаполненияМногооборотнойТары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеПроизводством2_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовМатериаловВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказМатериаловВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца</v8:Type>
						<v8:Type>cfg:DocumentRef.УСОERP_ПланПотребностейВМатериалах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПеремещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДлительностьПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотреблениеДляДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбосабливатьПоНазначениюЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УСОERP_РаспределениеМатериаловПоРаботам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроительнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_РаспределениеМатериаловПоСтроительнымРаботам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыИсходнаяПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИсходнаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаВозможностьОткрытия(Отказ)
	
	МассивСкладов = Новый Массив;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		МассивСкладов.Добавить(Параметры.ДанныеОбъекта.Склад);
		
		Если //Параметры.ДанныеОбъекта.Склад.ИспользоватьОрдернуюСхемуПриПоступлении = Истина ИЛИ 
			Параметры.ДанныеОбъекта.Склад.ИспользоватьОрдернуюСхемуПриПоступлении = Истина И 
			Параметры.ДанныеОбъекта.Склад.ДатаНачалаОрдернойСхемыПриПоступлении < Параметры.ДанныеОбъекта.Дата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В ордерных складах распределение указывается в документе ""Приходный ордер""",,,,Отказ);
			Возврат;
		КонецЕсли; 	
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		
		МассивСкладов.Добавить(Параметры.ДанныеОбъекта.Склад);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		
		МассивСкладов.Добавить(Параметры.ДанныеОбъекта.Склад);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказМатериаловВПроизводство") Тогда
		
		МассивСкладов.Добавить(Параметры.ДанныеОбъекта.Склад);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Для Каждого СтрокаТЗ ИЗ Параметры.ДанныеОбъекта.Товары Цикл
			
			Если МассивСкладов.Найти(СтрокаТЗ.Склад) = Неопределено Тогда
				МассивСкладов.Добавить(СтрокаТЗ.Склад);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСкладов",МассивСкладов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	ЕСТЬNULL(Склады.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам, ЛОЖЬ) = ИСТИНА
	|	И Склады.Ссылка В(&МассивСкладов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В объекте строительства не ведется распределение по работам",,,,Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  ТипЗнч(Параметры.ДанныеОбъекта) <> Тип("ДанныеФормыСтруктура") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Документ = Параметры.ДанныеОбъекта.Ссылка;
	
	ПроверитьНаВозможностьОткрытия(Отказ);
	
	ЗаполнитьТоварыИсходная(Отказ);	
	
	Элементы.Документ.Видимость = ЗначениеЗаполнено(Документ);
	Элементы.КомандаЗаполнитьПоУмолчанию.Видимость = ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику");
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТоварыИсходная(Отказ,ПоУмолчанию = Ложь)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТабТовары = Параметры.ДанныеОбъекта.Ссылка.Товары.Выгрузить();
	ТабТовары.Очистить();
	
	Для Каждого СтрокаТЗ ИЗ Параметры.ДанныеОбъекта.Товары Цикл
		ЗаполнитьЗначенияСвойств(ТабТовары.Добавить(),СтрокаТЗ);
	КонецЦикла;
	
	ТабРаспределение = Параметры.ДанныеОбъекта.Ссылка.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить();
	ТабРаспределение.Очистить();
	
	Для Каждого СтрокаТЗ ИЗ Параметры.ДанныеОбъекта.УСОERP_РаспределениеМатериаловПоРаботам Цикл
		ЗаполнитьЗначенияСвойств(ТабРаспределение.Добавить(),СтрокаТЗ);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ТабТовары",ТабТовары);
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		Запрос.УстановитьПараметр("Организация",Параметры.ДанныеОбъекта.Организация);
	КонецЕсли;
	
	ТолькоПросмотрКоличества = Ложь;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	ВЫРАЗИТЬ(ТаблицаТовары.Склад КАК Справочник.Склады) КАК Склад,
		|	ТаблицаТовары.Количество,
		|	ТаблицаТовары.СуммаСНДС,
		|	ТаблицаТовары.ДатаПоступления,
		|	ТаблицаТовары.Отменено,
		|	ВЫРАЗИТЬ(ТаблицаТовары.Назначение КАК Справочник.Назначения) КАК Назначение
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТабТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВложенныйЗапрос.Ссылка КАК СценарийПланирования,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	СУММА(ВрТаб.Количество) КАК Количество,
		|	ВрТаб.ДатаПоступления,
		|	СУММА(ВрТаб.СуммаСНДС) КАК СуммаСНДС,
		|	ВрТаб.Назначение.Заказ КАК Заказ,
		|	МИНИМУМ(ВрТаб.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК Ссылка,
		|			УСОERP_СценарииПланированияПроектовСтроительства.Владелец КАК Владелец
		|		ИЗ
		|			Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
		|		ГДЕ
		|			НЕ УСОERP_СценарииПланированияПроектовСтроительства.ПометкаУдаления
		|			И УСОERP_СценарииПланированияПроектовСтроительства.НомерВерсии = 0
		|			И УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)
		|			И УСОERP_СценарииПланированияПроектовСтроительства.Организация = &Организация) КАК ВложенныйЗапрос
		|		ПО ВрТаб.Склад.УСОERP_ОбъектСтроительства = ВложенныйЗапрос.Владелец
		|ГДЕ
		|	ВрТаб.Отменено = ЛОЖЬ
		|	И ЕСТЬNULL(ВрТаб.Склад.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам, ЛОЖЬ) = ИСТИНА
		|	И (ВрТаб.Назначение.Заказ ССЫЛКА Документ.ЗаказМатериаловВПроизводство
		|			ИЛИ ВрТаб.Назначение.Заказ ССЫЛКА Документ.ЗаказНаВнутреннееПотребление)
		|	И ВрТаб.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства,
		|	ВрТаб.ДатаПоступления,
		|	ВложенныйЗапрос.Ссылка,
		|	ВрТаб.Назначение.Заказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки"; 	
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказМатериаловВПроизводство") Тогда
		
		Склад = Параметры.ДанныеОбъекта.Склад;
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("Документ",Документ);
		Элементы.ТоварыРаспределениеКоличествоРаспределено.ТолькоПросмотр = Истина;	
		
		Если ТипЗнч(Параметры.ДанныеОбъекта.ДокументОснование) <>  Тип("ДокументСсылка.УСОERP_ПланПотребностейВМатериалах") Тогда
			
			Отказ = Истина;
			Возврат;		
			
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	ВЫРАЗИТЬ(&Склад КАК Справочник.Склады) КАК Склад,
		|	ТаблицаТовары.Количество,
		|	ТаблицаТовары.НачалоОтгрузки КАК ДатаПоступления,
		|	ТаблицаТовары.Отменено,
		|	ЗНАЧЕНИЕ(Справочник.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка) КАК СценарийПланирования,
		|	&Документ КАК Заказ
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТабТовары КАК ТаблицаТовары
		|ГДЕ
		|	(ВЫРАЗИТЬ(ТаблицаТовары.ВариантОбеспечения КАК Перечисление.ВариантыОбеспечения)) = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	СУММА(ВрТаб.Количество) КАК Количество,
		|	ВрТаб.ДатаПоступления,
		|	МИНИМУМ(ВрТаб.НомерСтроки) КАК НомерСтроки,
		|	ВрТаб.СценарийПланирования,
		|	ВрТаб.Заказ
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|ГДЕ
		|	ВрТаб.Отменено = ЛОЖЬ
		|	И ЕСТЬNULL(ВрТаб.Склад.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам, ЛОЖЬ) = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	ВрТаб.ДатаПоступления,
		|	ВрТаб.СценарийПланирования,
		|	ВрТаб.Заказ";
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		
		Склад = Параметры.ДанныеОбъекта.Склад;
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("Документ",Документ);
		Элементы.ТоварыРаспределениеКоличествоРаспределено.ТолькоПросмотр = Истина;	
		
		Если ТипЗнч(Параметры.ДанныеОбъекта.ДокументОснование) <>  Тип("ДокументСсылка.УСОERP_ПланПотребностейВМатериалах") Тогда
			
			Отказ = Истина;
			Возврат;		
			
		КонецЕсли;  		
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	ВЫРАЗИТЬ(&Склад КАК Справочник.Склады) КАК Склад,
		|	ТаблицаТовары.Количество,
		|	ТаблицаТовары.ДатаОтгрузки КАК ДатаПоступления,
		|	ТаблицаТовары.Отменено,
		|	ЗНАЧЕНИЕ(Справочник.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка) КАК СценарийПланирования,
		|	&Документ КАК Заказ
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТабТовары КАК ТаблицаТовары
		|ГДЕ
		|	(ВЫРАЗИТЬ(ТаблицаТовары.ВариантОбеспечения КАК Перечисление.ВариантыОбеспечения)) = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	СУММА(ВрТаб.Количество) КАК Количество,
		|	ВрТаб.ДатаПоступления,
		|	МИНИМУМ(ВрТаб.НомерСтроки) КАК НомерСтроки,
		|	ВрТаб.СценарийПланирования,
		|	ВрТаб.Заказ
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|ГДЕ
		|	ВрТаб.Отменено = ЛОЖЬ
		|	И ЕСТЬNULL(ВрТаб.Склад.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам, ЛОЖЬ) = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	ВрТаб.ДатаПоступления,
		|	ВрТаб.СценарийПланирования,
		|	ВрТаб.Заказ"; 
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		Запрос.УстановитьПараметр("Дата",НачалоДня(Параметры.ДанныеОбъекта.Дата));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) КАК ДатаПоступления,
		|	ТаблицаТовары.Количество,
		|	ЗНАЧЕНИЕ(Справочник.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка) КАК СценарийПланирования,
		|	ВЫРАЗИТЬ(ТаблицаТовары.Склад КАК Справочник.Склады) КАК Склад,
		|	ВЫРАЗИТЬ(ТаблицаТовары.Назначение КАК Справочник.Назначения) КАК Назначение
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТабТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	СУММА(ВрТаб.Количество) КАК Количество,
		|	ВрТаб.ДатаПоступления,
		|	МИНИМУМ(ВрТаб.НомерСтроки) КАК НомерСтроки,
		|	ВрТаб.СценарийПланирования,
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Документ.ЗаказНаВнутреннееПотребление.ПустаяСсылка)) КАК Заказ
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|ГДЕ
		|	(ВрТаб.Назначение.Заказ ССЫЛКА Документ.ЗаказМатериаловВПроизводство
		|			ИЛИ ВрТаб.Назначение.Заказ ССЫЛКА Документ.ЗаказНаВнутреннееПотребление)
		|	И ЕСТЬNULL(ВрТаб.Склад.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам, ЛОЖЬ) = ИСТИНА
		|	И ВрТаб.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	ВрТаб.ДатаПоступления,
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства,
		|	ВрТаб.СценарийПланирования";
		
		 ТолькоПросмотрКоличества = Истина;
		 
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
		
		Склад = Параметры.ДанныеОбъекта.Склад;
		Запрос.УстановитьПараметр("Дата",НачалоДня(Параметры.ДанныеОбъекта.Дата));
		Запрос.УстановитьПараметр("Склад",Склад);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.Характеристика,
		|	НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) КАК ДатаПоступления,
		|	ТаблицаТовары.Количество,
		|	ЗНАЧЕНИЕ(Справочник.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка) КАК СценарийПланирования,
		|	ВЫРАЗИТЬ(&Склад КАК Справочник.Склады) КАК Склад,
		|	ВЫРАЗИТЬ(ТаблицаТовары.Назначение КАК Справочник.Назначения) КАК Назначение
		|ПОМЕСТИТЬ ВрТаб
		|ИЗ
		|	&ТабТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства КАК ОбъектСтроительства,
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	СУММА(ВрТаб.Количество) КАК Количество,
		|	ВрТаб.ДатаПоступления,
		|	МИНИМУМ(ВрТаб.НомерСтроки) КАК НомерСтроки,
		|	ВрТаб.СценарийПланирования,
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Документ.ЗаказНаВнутреннееПотребление.ПустаяСсылка)) КАК Заказ
		|ИЗ
		|	ВрТаб КАК ВрТаб
		|ГДЕ
		|	(ВрТаб.Назначение.Заказ ССЫЛКА Документ.ЗаказМатериаловВПроизводство
		|			ИЛИ ВрТаб.Назначение.Заказ ССЫЛКА Документ.ЗаказНаВнутреннееПотребление)
		|	И ЕСТЬNULL(ВрТаб.Склад.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам, ЛОЖЬ) = ИСТИНА
		|	И ВрТаб.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТаб.Номенклатура,
		|	ВрТаб.Характеристика,
		|	ВрТаб.ДатаПоступления,
		|	ВрТаб.Склад.УСОERP_ОбъектСтроительства,
		|	ВрТаб.СценарийПланирования";
		
		ТолькоПросмотрКоличества = Истина;
		
	Иначе
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ТоварыИсходная.Очистить();
	ТоварыРаспределение.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураОтбора = Новый Структура("ОбъектСтроительства,Номенклатура,Характеристика,ДатаПоступления");
	
	СтруктураОтбораБезДаты = Новый Структура("ОбъектСтроительства,Номенклатура,Характеристика");
	
	СтруктураОтбораРаботы = Новый Структура("СтроительнаяРабота,Номенклатура,Характеристика");
	СтруктураОтбораРаботыСДатой = Новый Структура("СтроительнаяРабота,Номенклатура,Характеристика,ДатаПоступления"); 
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора,Выборка);
		ЗаполнитьЗначенияСвойств(СтруктураОтбораБезДаты,Выборка);
		НоваяСтрока = ТоварыИсходная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);		
		
		ТабРабот = Выборка.Заказ.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить().Скопировать(СтруктураОтбора);
		
		Если НЕ ТабРабот.Количество() Тогда
			
			ТабРабот = Выборка.Заказ.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить().Скопировать(СтруктураОтбораБезДаты);
			ТабРабот.ЗаполнитьЗначения(Выборка.ДатаПоступления,"ДатаПоступления");
			ТабРабот.ЗаполнитьЗначения(0,"Количество");
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") 
				ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
				
				Для Каждого СтрокаРабот ИЗ Параметры.ДанныеОбъекта.УСОERP_РаспределениеМатериаловПоРаботам.НайтиСтроки(СтруктураОтбораБезДаты) Цикл
					ЗаполнитьЗначенияСвойств(ТабРабот.Добавить(),СтрокаРабот);
				КонецЦикла;
				
			КонецЕсли;
			
			ТабРабот.Свернуть("ОбъектСтроительства,СтроительнаяРабота,ДатаПоступления,Номенклатура,Характеристика","Количество,Стоимость");
			
		КонецЕсли;
		
		НоваяСтрока.КоличествоРаспределено = ТабРабот.Итог("Количество");
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику")
			И НЕ ПоУмолчанию Тогда
			
			НоваяСтрока.КоличествоРаспределено =  Параметры.ДанныеОбъекта.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить().Скопировать(СтруктураОтбора).Итог("Количество");
			
		КонецЕсли; 	
		
		Для Каждого СтрокаРабот ИЗ ТабРабот Цикл
			
			НоваяСтрока = ТоварыРаспределение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРабот);
			НоваяСтрока.СценарийПланирования = Выборка.СценарийПланирования;
			НоваяСтрока.КоличествоРаспределено = СтрокаРабот.Количество; 
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику") И НЕ ПоУмолчанию Тогда
				
				ЗаполнитьЗначенияСвойств(СтруктураОтбораРаботыСДатой,СтрокаРабот);
				
				НоваяСтрока.КоличествоРаспределено =  Параметры.ДанныеОбъекта.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить().Скопировать(СтруктураОтбораРаботыСДатой).Итог("Количество");
				
			КонецЕсли; 			
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				
				ЗаполнитьЗначенияСвойств(СтруктураОтбораРаботы,НоваяСтрока);
				НоваяСтрока.КоличествоРаспределено = Параметры.ДанныеОбъекта.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить().Скопировать(СтруктураОтбораРаботы).Итог("Количество");
				
			КонецЕсли;
			
		КонецЦикла; 		
		
	КонецЦикла;
	
	Если НЕ ТоварыИсходная.Количество() Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если ТолькоПросмотрКоличества Тогда
		
		Элементы.ТоварыРаспределениеКоличествоРаспределено.ТолькоПросмотр = Истина;
		Элементы.ФормаКомандаПеренестиВДокумент.Видимость = Ложь;
		
	Иначе
		
		Элементы.Корректировка.Видимость = Ложь;
		
	КонецЕсли;	
	
	ЗаполнитьТаблицуРезультат(); 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРезультат()
	
	Запрос = Новый Запрос;
	
	ТабРезультат = РеквизитФормыВЗначение("ТаблицаРезультат");
	ТабРезультат.Очистить();
	
	ТабРаспределено = РеквизитФормыВЗначение("ТоварыРаспределение");
	ТабРаспределено.Свернуть("ОбъектСтроительства,СтроительнаяРабота,Номенклатура,Характеристика","КоличествоРаспределено");
	ТабИсходная = РеквизитФормыВЗначение("ТоварыИсходная");
	ТабИсходная.Свернуть("Заказ");
	МассивЗаказов = ТабИсходная.ВыгрузитьКолонку("Заказ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	Запрос.УстановитьПараметр("ТабРаспределено",ТабРаспределено);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабРаспределено.ОбъектСтроительства,
	|	ТабРаспределено.СтроительнаяРабота,
	|	ТабРаспределено.Номенклатура,
	|	ТабРаспределено.Характеристика,
	|	ТабРаспределено.КоличествоРаспределено
	|ПОМЕСТИТЬ ВрТабРаспределено
	|ИЗ
	|	&ТабРаспределено КАК ТабРаспределено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота,
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура,
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Количество,
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.ОбъектСтроительства КАК ОбъектСтроительства,
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	Документ.ЗаказМатериаловВПроизводство.УСОERP_РаспределениеМатериаловПоРаботам КАК ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам
	|ГДЕ
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Ссылка В(&МассивЗаказов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота,
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура,
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Количество,
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.ОбъектСтроительства,
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Характеристика
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.УСОERP_РаспределениеМатериаловПоРаботам КАК ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам
	|ГДЕ
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Ссылка В(&МассивЗаказов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.СтроительнаяРабота,
	|	ВрТаб.Номенклатура,
	|	СУММА(ВрТаб.Количество) КАК Количество,
	|	ВрТаб.ОбъектСтроительства,
	|	ВрТаб.Характеристика,
	|	ВложенныйЗапрос.КоличествоРаспределено
	|ПОМЕСТИТЬ ВрРезультат
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВрТабРаспределено.ОбъектСтроительства КАК ОбъектСтроительства,
	|			ВрТабРаспределено.СтроительнаяРабота КАК СтроительнаяРабота,
	|			ВрТабРаспределено.Номенклатура КАК Номенклатура,
	|			ВрТабРаспределено.Характеристика КАК Характеристика,
	|			СУММА(ВрТабРаспределено.КоличествоРаспределено) КАК КоличествоРаспределено
	|		ИЗ
	|			ВрТабРаспределено КАК ВрТабРаспределено
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВрТабРаспределено.Номенклатура,
	|			ВрТабРаспределено.Характеристика,
	|			ВрТабРаспределено.СтроительнаяРабота,
	|			ВрТабРаспределено.ОбъектСтроительства) КАК ВложенныйЗапрос
	|		ПО ВрТаб.ОбъектСтроительства = ВложенныйЗапрос.ОбъектСтроительства
	|			И ВрТаб.СтроительнаяРабота = ВложенныйЗапрос.СтроительнаяРабота
	|			И ВрТаб.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И ВрТаб.Характеристика = ВложенныйЗапрос.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаб.СтроительнаяРабота,
	|	ВрТаб.Номенклатура,
	|	ВрТаб.ОбъектСтроительства,
	|	ВрТаб.Характеристика,
	|	ВложенныйЗапрос.КоличествоРаспределено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрРезультат.СтроительнаяРабота,
	|	ВрРезультат.Номенклатура КАК Номенклатура,
	|	ВрРезультат.Количество,
	|	ВрРезультат.ОбъектСтроительства,
	|	ВрРезультат.Характеристика КАК Характеристика,
	|	ВрРезультат.КоличествоРаспределено,
	|	ВЫБОР
	|		КОГДА ВрРезультат.КоличествоРаспределено > ВрРезультат.Количество
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаРаспределения
	|ИЗ
	|	ВрРезультат КАК ВрРезультат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОшибкаРаспределения УБЫВ,
	|	ВрРезультат.СтроительнаяРабота.КодСДР,
	|	Номенклатура,
	|	Характеристика";
	
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаРаспределение ИЗ ТабРаспределено Цикл
		Если ТЗ.Найти(СтрокаРаспределение.СтроительнаяРабота) = Неопределено Тогда
			Нстр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаРаспределение);  						
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ,"ТаблицаРезультат"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ЗаполнитьТоварыИсходная(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура КомандаПеренестиВДокументНаСервере()
	
	Таблица = РеквизитФормыВЗначение("ТоварыРаспределение");
	Таблица.Свернуть("ОбъектСтроительства,СценарийПланирования,СтроительнаяРабота,ДатаПоступления,Номенклатура,Характеристика","КоличествоРаспределено,Стоимость");
	
	Строки = Таблица.НайтиСтроки(Новый Структура("КоличествоРаспределено",0));
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		Таблица.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Строки = Таблица.НайтиСтроки(Новый Структура("СтроительнаяРабота",Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка()));
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		Таблица.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Строки = Таблица.НайтиСтроки(Новый Структура("ДатаПоступления",Дата(1,1,1)));
	Строки = Таблица.НайтиСтроки(Новый Структура("СтроительнаяРабота",Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка()));
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		Таблица.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ЗначениеВРеквизитФОрмы(Таблица,"ТоварыРаспределение");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВДокумент(Команда)
	
	Строки = ТаблицаРезультат.НайтиСтроки(Новый Структура("ОшибкаРаспределения",Истина));
	
	Если Строки.Количество() Тогда
		
		ПоказатьПредупреждение(,"Неверно распределены материалы по работам!");
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраницаРезультат;
		Возврат;
	КонецЕсли;
	
	КомандаПеренестиВДокументНаСервере();
	
	ОповеститьОВыборе(ТоварыРаспределение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаспределениеКоличествоРаспределеноПриИзменении(Элемент)
	
	СтрокаИсходная = Элементы.ТоварыИсходная.ТекущиеДанные;
	Если СтрокаИсходная = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МаксКоличество = СтрокаИсходная.Количество;
	
	ТекСтрока =  Элементы.ТоварыРаспределение.ТекущиеДанные;
	
	УидСтроки = СтрокаИсходная.ПолучитьИдентификатор();
	
	КоличествоРаспределено = РаспределенноеКоличествоПоСтроке(УидСтроки)-ТекСтрока.КоличествоРаспределено;
	
	ТекСтрока.КоличествоРаспределено = МИН(МаксКоличество-КоличествоРаспределено,ТекСтрока.КоличествоРаспределено);
	ТекСтрока.Стоимость = ТекСтрока.КоличествоРаспределено*СтрокаИсходная.СуммаСНДС/СтрокаИсходная.Количество;
	
	СтрокаИсходная.КоличествоРаспределено = РаспределенноеКоличествоПоСтроке(УидСтроки);
	
КонецПроцедуры

&НаСервере
Функция   РаспределенноеКоличествоПоСтроке(УидСтроки,БезТекущейСтроки = Ложь)
	
	ТабРаспределено = РеквизитФормыВЗначение("ТоварыРаспределение");
	ТекСтрока = ТоварыИсходная.НайтиПоИдентификатору(УидСтроки);
	СтруктураОтбора = Новый Структура("СценарийПланирования,Номенклатура,Характеристика,ДатаПоступления",ТекСтрока.СценарийПланирования,ТекСтрока.Номенклатура,ТекСтрока.Характеристика,ТекСтрока.ДатаПоступления);
	
	Таб = ТабРаспределено.Скопировать(СтруктураОтбора);
	
	Результат = Таб.Итог("КоличествоРаспределено");  
	
	Возврат Результат;
	
КонецФункции  

&НаКлиенте
Процедура ТоварыИсходнаяПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.ТоварыИсходная.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		СтруктураОтбора = Новый Структура("КоличествоРаспределено",-12);
	Иначе 		
		СтруктураОтбора = Новый Структура("СценарийПланирования,Номенклатура,Характеристика,ДатаПоступления",ТекСтрока.СценарийПланирования,ТекСтрока.Номенклатура,ТекСтрока.Характеристика,ТекСтрока.ДатаПоступления);
	КонецЕсли;
	
	Элементы.ТоварыРаспределение.ОтборСтрок  = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаспределениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекСтрока = Элементы.ТоварыИсходная.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаспределениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСТрока Тогда
		
		СтрокаИсходная = Элементы.ТоварыИсходная.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(Элементы.ТоварыРаспределение.ТекущиеДанные,СтрокаИсходная,,"КоличествоРаспределено");
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаспределениеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьТаблицуРезультат();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаспределениеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПриИзменении(Элемент)
	
	Элементы.ТоварыРаспределениеКоличествоРаспределено.ТолькоПросмотр = НЕ Корректировка;
	Элементы.ФормаКомандаПеренестиВДокумент.Видимость = Корректировка;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьТоварыИсходная(Ложь,Истина);
КонецПроцедуры
